# Визначення персонажів гри.
define Y = Character(_("Я"), color="#4169E1")
define S = Character(_("Слава Анімушник"), color="#000080")
define V = Character(_("Влад Грубий"), color="#008000")
define M = Character(_("Марік Бандіт"), color="#FF0000")
define N = Character(_("Василина Заміжня"), color="#FF1493")
define T = Character(_("Тарасик Телесик"), color="#778899")
define I = Character(_("Іванка Модель"), color="#6A5ACD")
define U = Character(_("Юра Циган"), color="#8B4513")

define A = Character(_("Арсен Узумакі"), color="#FFFF00")
define L = Character(_("Валєра Міладзе"), color="#006400")
define P = Character(_("Містер Пропер"), color="#FFFF00")

# Початок гри:
label start:
    "{b}ДІСКЛЕЙМЕР! Всі персонажі придумані автором гри. Всі співпадіння випадкові.{/b}"

    $ player_name = renpy.input("Твоє імя? (Якщо не хочеш вибирати, натисни Enter)")

    $ player_name = player_name.strip()

    # .strip() - даний параметр видалить лишні або випадково набрані гравцем пробіли.
    # Якщо гравець не хоче придумувати ім'я, то буде використано по замовчуванні:

    if player_name == "":
        $ player_name = "Михайло"
   # Тепер інші персонажі можуть звертатись вибраним ім'ям.
   
    show bg college 
    # Задній фон.
    
    # Початок сюжету.
    "{i}Сьогодні перший навчальний день після канікул. Другий семестр. Я вчусь на програміста, адже це так цікаво, а ще, я обожнюю математику!!{/i}"
    "{i}Зараз я навчаюсь на 4 курсі і скоро закінчу коледж. Від мене залежить моє майбутнє після нього.{/i}"
    "{i}На вході в коледж висить вивіска: <<Політех - це успіх>> Я точно стану успішним програмістом!!{/i}"
    "{i}Мені дуже подобається навчатись в групі П-41. Це точно найкраща група, не те що ті П-42.{/i}"
    
    "Люди почали збиратись біля входу. Там стояв якийсь дивний хлопець, який ковиряв ногою землю. Здається він новенький."
    "Дивний хлопець" "Привіт! Мене звати Слава. Я новенький, але я дуже шарю в програмуванні. І я Анімешник! А ти?"
    Y "А мене звати [player_name]. Приємно познайомитись! Я навчаюсь тут з першого курсу."
    S "Ваау! Так круто! Давай дружити?"
    "Цей хлопець здається хорошим, але якийсь дивний.. Чи варто мені з ним дружити? Адже в мене є друзі в групі.. Хоча я і хотів би справжнього найкращого друга."
    
    # Меню вибору.
    # При виборі, відбувається перехід до певної мітки.
    menu:
        "{cps=0}Цей хлопець здається хорошим, але якийсь дивний.. Чи варто мені з ним дружити? Адже в мене є друзі в групі.. Хоча я і хотів би справжнього найкращого друга.{/cps}"
        # Якщо гравець вибирає Так, відбувається перехід до мітки choice1_yes
        "Так. Чому б і ні?":
            jump choice1_yes
                                      
        # Якщо гравець вибирає Ні, відбувається перехід до мітки choice1_no
        "Ні. В мене вже є друзі.":
            jump choice1_no

    label choice1_yes:
        # Якщо гравець вибирає так, додається один бал.
        $ menu_flag = True
        Y "Так, давай дружити!"

        jump choice1_done

    label choice1_no:
        # Якщо гравець вибирає ні, бал віднімається.
        $ menu_flag = False
        Y "Ми ж одногрупники! Ми вже друзі."

        jump choice1_done

    label choice1_done:

        # ... гра продовжується тут.
 
    Y "Добре, я йду, мені потрібно ще.. ем.. ну треба мені."
    "Він звісно і новенький, але я не хочу з ним зараз тусуватись. Є справи важливіші."


    return
